Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNoSingleRef Property
 Summary: Structural Connection Handler lost connected element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionNoSingleRef { get; }
Public Shared ReadOnly Property StructuralConnectionNoSingleRef As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionNoSingleRef {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionNoSingleRef : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace